{
  "backend/main.mo": "Defines a booking actor with CRUD operations storing bookings in a Map and enforcing basic field validation.",
  "backend/migration.mo": "Provides a no-op migration module that returns the old actor state unchanged.",
  "feature_evidence.json": "Lists feature evidence linking frontend files to implemented admin and navigation features with associated metadata.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files and their roles in the project.",
  "frontend/index.css": "Configures Tailwind base layers and theme variables for light and dark modes using OKLCH color values.",
  "frontend/index.html": "HTML entry point setting metadata and loading fonts and the main React bundle.",
  "frontend/src/App.tsx": "Top-level React component managing navigation state and rendering pages with a header and footer.",
  "frontend/src/components/BookingForm.tsx": "Interactive booking form with validation, loading states, and submission via a React Query hook.",
  "frontend/src/components/SiteFooter.tsx": "Footer component displaying branding, contact details, services list, and attribution.",
  "frontend/src/components/SiteHeader.tsx": "Responsive site header with logo, navigation links, and mobile menu toggle handling page navigation.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useDeleteBooking.ts": "Provides a mutation to delete a booking via the backend actor and refreshes the bookings list on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, providing login, logout, and identity loading through a React context.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching all bookings or a single booking using the backend actor.",
  "frontend/src/hooks/useSubmitBooking.ts": "Submits a new booking with timestamp via the backend actor and invalidates booking queries after success.",
  "frontend/src/index.css": "Tailwind-based global styles defining warm light/dark themes, typography, and utility classes.",
  "frontend/src/main.tsx": "Initializes the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for viewing, sorting, and deleting booking submissions using tables and alerts.",
  "frontend/src/pages/ContactPage.tsx": "Contact page displaying contact details and a booking form with styled sections and icons.",
  "frontend/src/pages/GalleryPage.tsx": "A portfolio gallery page showing images in a grid with animations and a lightbox for enlarged viewing.",
  "frontend/src/pages/HomePage.tsx": "Homepage with a hero section, call‑to‑action buttons, and a features list highlighting the studio’s strengths.",
  "frontend/src/pages/ServicesPage.tsx": "Displays a grid of photography service offerings, each with icons, descriptions, and key feature lists.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins for typography, container queries, and animations.",
  "project_state.json": "JSON file describing the project’s state, existing features, requirements, and development metadata."
}