{
  "kind": "build_request",
  "title": "Add Admin Dashboard to View Stored Booking Inquiries",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Add an Admin page that lists all stored booking inquiries from the backend and renders them in an easy-to-scan table/list (at minimum: name, phone, event type, preferred date, submitted timestamp, and the booking id).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "For now, customers’ entries are saved inside your site’s booking storage, and you can view them anytime. Just tell me if you want me to add an admin page to read them easily.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "A new Admin page exists in the frontend and can be opened from the running site without needing developer tools.",
        "The Admin page loads bookings using the existing React Query hook pattern (via the backend actor) and shows a loading and empty state.",
        "Each booking entry shows at least: id, name, phone, eventType, preferredDate, and a human-readable submitted time derived from the stored timestamp."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Expose navigation to the Admin page from the existing UI (e.g., add an 'Admin' entry in the header navigation or an 'Admin' link in the footer) and ensure navigation scrolls to the top consistently with existing navigation behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "Just tell me if you want me to add an admin page to read them easily.",
          "Yes"
        ]
      },
      "acceptanceCriteria": [
        "There is a visible way for the site owner to open the Admin page from within the site UI.",
        "Navigating to the Admin page uses the same in-app navigation approach as the existing pages and scrolls to top like other nav actions."
      ]
    },
    {
      "id": "REQ-10",
      "text": "Add basic booking management actions on the Admin page: allow deleting a booking inquiry and refreshing the list after deletion.",
      "target": "both",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "add an admin page to read them easily"
        ]
      },
      "acceptanceCriteria": [
        "Each booking row/card has a Delete action.",
        "Deleting a booking calls the existing backend delete operation and, on success, the booking is removed from the list without a full page reload (React Query invalidation/refetch is acceptable).",
        "If deletion fails, show an English error message on the Admin page without crashing the app."
      ]
    },
    {
      "id": "REQ-11",
      "text": "Ensure the backend booking list is presented in a useful order on the Admin page (newest first) without breaking existing booking submission behavior.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages"
        ],
        "quotes": [
          "saved inside your site’s booking storage, and you can view them anytime"
        ]
      },
      "acceptanceCriteria": [
        "The Admin page displays bookings sorted by timestamp descending (newest inquiries appear first).",
        "No backend data loss occurs; submitting bookings still works as before."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths (compose existing components instead).",
    "Use English for any user-facing text added by this change."
  ],
  "nonGoals": [
    "Email/SMS/push notifications for new booking submissions (not supported without the paid Email feature).",
    "Adding third-party authentication or restricting the Admin page behind a new auth system (Internet Identity changes not requested).",
    "Building a full CRM workflow (status tracking, assignment, exporting, etc.)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}