{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin dashboard for viewing and managing booking inquiries",
  "requirements": [
    {
      "id": "REQ-8",
      "summary": "Create an Admin page that fetches all stored booking inquiries via the existing React Query hook pattern and renders them in a scannable table/list with required fields and states.",
      "acceptanceCriteria": [
        "A new Admin page exists in the frontend and can be opened from the running site without needing developer tools.",
        "The Admin page loads bookings using the existing React Query hook pattern (via the backend actor) and shows a loading and empty state.",
        "Each booking entry shows at least: id, name, phone, eventType, preferredDate, and a human-readable submitted time derived from the stored timestamp."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "create",
          "description": "Add an Admin page that uses the existing useGetAllBookings React Query hook to load bookings and render them in a table/list with columns for id, name, phone, event type, preferred date, and a human-readable submitted timestamp; include loading and empty states; keep all user-facing text in English."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new Admin page into the app’s page switch so it is reachable from in-app navigation (no developer tools needed)."
        }
      ]
    },
    {
      "id": "REQ-9",
      "summary": "Expose in-app navigation to the Admin page and keep scroll-to-top behavior consistent with existing navigation.",
      "acceptanceCriteria": [
        "There is a visible way for the site owner to open the Admin page from within the site UI.",
        "Navigating to the Admin page uses the same in-app navigation approach as the existing pages and scrolls to top like other nav actions."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Add an 'Admin' navigation item using the same navigation mechanism as other pages and ensure it uses the existing handleNavigate behavior to scroll to top consistently."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Extend the app’s Page union/type to include 'admin' and ensure the Admin page is selectable via existing in-app navigation state."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Add booking deletion and refresh behavior on the Admin page using the existing backend actor operation and React Query invalidation/refetch, with safe error messaging.",
      "acceptanceCriteria": [
        "Each booking row/card has a Delete action.",
        "Deleting a booking calls the existing backend delete operation and, on success, the booking is removed from the list without a full page reload (React Query invalidation/refetch is acceptable).",
        "If deletion fails, show an English error message on the Admin page without crashing the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useDeleteBooking.ts",
          "operation": "create",
          "description": "Create a React Query mutation hook that calls the backend actor deleteBooking capability and invalidates/refetches the ['bookings'] query on success; surface errors for display in the UI."
        },
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Add a Delete action per booking row/card that uses the new useDeleteBooking mutation; on success trigger React Query invalidation/refetch so the removed booking disappears without full page reload; on failure display an English error message on the page without crashing."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Present bookings in newest-first order on the Admin page while keeping existing submission behavior unchanged.",
      "acceptanceCriteria": [
        "The Admin page displays bookings sorted by timestamp descending (newest inquiries appear first).",
        "No backend data loss occurs; submitting bookings still works as before."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AdminPage.tsx",
          "operation": "modify",
          "description": "Sort the fetched bookings by timestamp descending (newest first) before rendering; do not change booking submission flow or other pages."
        }
      ]
    }
  ]
}